alefragnani.project-manager
andyyaldoo.vscode-json
angular.ng-template
arturock.gitstash
augustbright.quick-pin
awwsky.regionmarker
be5invis.vscode-custom-css
beardedbear.beardedtheme
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
ctf0.macros
cyrilletuzi.angular-schematics
dbaeumer.vscode-eslint
donjayamanne.githistory
esbenp.prettier-vscode
fnando.linter
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
ibm.output-colorizer
infinity1207.angular2-switcher
johnpapa.vscode-peacock
kisstkondoros.typelens
kuscamara.remove-unused-imports
lakshits11.best-themes-redefined
leizongmin.node-module-intellisense
lokalise.i18n-ally
mattpocock.ts-error-translator
mhutchie.git-graph
mohsen1.prettify-json
mrob95.breakpoint-highlighter
nguyenngoclong.terminal-keeper
nicoespeon.abracadabra
oderwat.indent-rainbow
pkief.material-icon-theme
pmneo.tsimporter
postman.postman-for-vscode
steoates.autoimport
stevebushresearch.buildoutputcolorizer
streetsidesoftware.code-spell-checker
stringham.move-ts
thomaskarachristos.terminal-statusbar
usernamehw.errorlens
wallabyjs.console-ninja
wayou.vscode-todo-highlight
yoavbls.pretty-ts-errors